{
    "id": "0ab6d4d5",
    "titre": "The Gift of the Magi",
    "auteur_nom": "O. Henry",
    "categories": [],
    "date_publication": "1900-01-01",
    "etat_classe": "EtatValidee",
    "contenu_markdown": "The Gift of the Magi\nThe Gift of the Magi\nONE DOLLAR AND EIGHTY-SEVEN CENTS.\nThat was all. She had put it aside, one cent and then another and then\nanother, in her careful buying of meat and other food. Della counted\nit three times. One dollar and eighty-seven cents. And the next day\nwould be Christmas.\nThere was nothing to do but fall on the bed and cry. So Della did it.\nWhile the lady of the home is slowly growing quieter, we can\nlook at the home. Furnished rooms at a cost of $8 a week. There is lit-\ntle more to say about it.\nIn the hall below was a letter-box too small to hold a letter. There\nwas an electric bell, but it could not make a sound. Also there was a\nname beside the door: \"Mr. James Dillingham Young.\"\n1\n\nO. Henry\nWhen the name was placed there, Mr. James Dillingham Young\nwas being paid $30 a week. Now, when he was being paid only $20 a\nweek, the name seemed too long and important. It should perhaps have\nbeen \"Mr. James D. Young.” But when Mr. James Dillingham Young\nentered the furnished rooms, his name became very short indeed. Mrs.\nJames Dillingham Young put her arms warmly about him and called\nhim \"Jim.\" You have already met her. She is Della.\nDella finished her crying and cleaned the marks of it from her face.\nShe stood by the window and looked out with no interest. Tomorrow\nwould be Christmas Day, and she had only $1.87 with which to buy\nJim a gift. She had put aside as much as she could for months, with this\nresult. Twenty dollars a week is not much. Everything had cost more\nthan she had expected. It always happened like that.\nOnly $ 1.87 to buy a gift for Jim. Her Jim. She had had many happy\nhours planning something nice for him. Something nearly good enough.\nSomething almost worth the honor of belonging to Jim.\nThere was a looking-glass between the windows of the room. Per-\nhaps you have seen the kind of looking-glass that is placed in $8 fur-\nnished rooms. It was very narrow. A person could see only a little of\nhimself at a time. However, if he was very thin and moved very quickly,\nhe might be able to get a good view of himself. Della, being quite thin,\nhad mastered this art.\nSuddenly she turned from the window and stood before the glass.\nHer eyes were shining brightly, but her face had lost its color. Quickly\nshe pulled down her hair and let it fall to its complete length.\nThe James Dillingham Youngs were very proud of two things which\nthey owned. One thing was Jim's gold watch. It had once belonged to\nhis father. And, long ago, it had belonged to his father's father. The\nother thing was Della's hair.\nIf a queen had lived in the rooms near theirs, Della would have\nwashed and dried her hair where the queen could see it. Della knew\nher hair was more beautiful than any queen's jewels and gifts.\nIf a king had lived in the same house, with all his riches, Jim would\nhave looked at his watch every time they met. Jim knew that no king\n2\n\nThe Gift of the\nhad anything so valuable.\nMagi\nSo now Della's beautiful hair fell about her, shining like a falling\nstream of brown water. It reached below her knee. It almost made itself\ninto a dress for her.\nAnd then she put it up on her head again, nervously and quickly.\nOnce she stopped for a moment and stood still while a tear or two ran\ndown her face.\nShe put on her old brown coat. She put on her old brown hat.\nWith the bright light still in her eyes, she moved quickly out the door\nand down to the street.\nWhere she stopped, the sign said: “Mrs. Sofronie. Hair Articles\nof all Kinds.\"\nat it.\"\nUp to the second floor Della ran, and stopped to get her breath.\nMrs. Sofronie, large, too white, cold-eyed, looked at her.\n\"Will you buy my hair?\" asked Della.\n\"I buy hair,\" said Mrs. Sofronie. \"Take your hat off and let me look\nDown fell the brown waterfall.\n\"Twenty dollars,\" said Mrs. Sofronie, lifting the hair to feel its\nweight.\n\"Give it to me quick,\" said Della.\nOh, and the next two hours seemed to fly. She was going from\none shop to another, to find a gift for Jim.\nShe found it at last. It surely had been made for Jim and no one\nelse. There was no other like it in any of the shops, and she had looked\nin every shop in the city.\nIt was a gold watch chain, very simply made. Its value was in its\nrich and pure material. Because it was so plain and simple, you knew\nthat it was very valuable. All good things are like this.\nIt was good enough for The Watch.\nAs soon as she saw it, she knew that Jim must have it. It was like\nhim. Quietness and value-Jim and the chain both had quietness and\nvalue. She paid twenty-one dollars for it. And she hurried home with\nthe chain and eighty-seven cents.\n3\n\nO. Henry\nWith that chain on his watch, Jim could look at his watch and\nlearn the time anywhere he might be. Though the watch was so fine,\nit had never had a fine chain. He sometimes took it out and looked at\nit only when no one could see him do it.\nWhen Della arrived home, her mind quieted a little. She began to\nthink more reasonably. She started to try to cover the sad marks of what\nshe had done. Love and large-hearted giving, when added together, can\nleave deep marks. It is never easy to cover these marks, dear friends-\nnever easy.\nWithin forty minutes her head looked a little better. With her\nshort hair, she looked wonderfully like a schoolboy. She stood at the\nlooking-glass for a long time.\n\"If Jim doesn't kill me,\" she said to herself, \"before he looks at me\na second time, he'll say I look like a girl who sings and dances for money.\nBut what could I do-oh! What could I do with a dollar and eighty-\nseven cents?\"\nAt seven, Jim's dinner was ready for him.\nJim was never late. Della held the watch chain in her hand and\nsat near the door where he always entered. Then she heard his step in\nthe hall and her face lost color for a moment. She often said little prayers\nquietly, about simple everyday things. And now she said: \"Please God,\nmake him think I'm still pretty.\"\nThe door opened and Jim stepped in. He looked very thin and he\nwas not smiling. Poor fellow, he was only twenty-two-and with a fam-\nily to take care of! He needed a new coat and he had nothing to cover\nhis cold hands.\nJim stopped inside the door. He was as quiet as a hunting dog when\nit is near a bird. His eyes looked strangely at Della, and there was an\nexpression in them that she could not understand. It filled her with fear.\nIt was not anger, nor surprise, nor anything she had been ready for. He\nsimply looked at her with that strange expression on his face.\nDella went to him.\n\"Jim, dear,\" she cried, \"don't look at me like that. I had my hair cut\noff and sold it. I couldn't live through Christmas without giving you a\n4\n\nThe Gift of the\nMagi\ngift. My hair will grow again. You won't care, will you? My hair grows\nvery fast. It's Christmas, Jim. Let's be happy. You don't know what a\nnice-what a beautiful nice gift I got for you.\"\n\"You've cut off your hair?\" asked Jim slowly. He seemed to labor\nto understand what had happened. He seemed not to feel sure he\nknew.\n\"Cut it off and sold it,\" said Della. \"Don't you like me now? I'm\nme, Jim. I'm the same without my hair.\"\nJim looked around the room.\n\"You say your hair is gone?\" he said.\n\"You don't have to look for it,\" said Della. \"It's sold, I tell you-\nsold and gone, too. It's the night before Christmas, boy. Be good to me,\nbecause I sold it for you. Maybe the hairs of my head could be counted,\"\nshe said, \"but no one could ever count my love for you. Shall we eat\ndinner, Jim?\"\nJim put his arms around his Della. For ten seconds let us look in\nanother direction. Eight dollars a week or a million dollars a year-\nhow different are they? Someone may give you an answer, but it will\nbe wrong. The magi brought valuable gifts, but that was not among\nthem. My meaning will be explained soon.\nFrom inside the coat, Jim took something tied in paper. He threw\nit upon the table.\n\"I want you to understand me, Dell,\" he said. \"Nothing like a\nhaircut could make me love you any less. But if you'll open that, you\nmay know what I felt when I came in.\"\nWhite fingers pulled off the paper. And then a cry of joy; and\nthen a change to tears.\nFor there lay The Combs-the combs that Della had seen in a\nshop window and loved for a long time. Beautiful combs, with jewels,\nperfect for her beautiful hair. She had known they cost too much for\nher to buy them. She had looked at them without the least hope of\nowning them. And now they were hers, but her hair was gone.\nBut she held them to her heart, and at last was able to look up\nand say: \"My hair grows so fast, Jim!\"\n5\n\nO. Henry\nAnd then she jumped up and cried, \"Oh, oh!\"\nJim had not yet seen his beautiful gift. She held it out to him in\nher open hand. The gold seemed to shine softly as if with her own warm\nand loving spirit.\n\"Isn't it perfect, Jim? I hunted all over town to find it. You'll have\nto look at your watch a hundred times a day now. Give me your watch.\nI want to see how they look together.\"\nJim sat down and smiled.\n\"Della,\" said he, \"let's put our Christmas gifts away and keep them\na while. They're too nice to use now. I sold the watch to get the money\nto buy the combs. And now I think we should have our dinner.\"\nThe magi, as you know, were wise men-wonderfully wise men—\nwho brought gifts to the newborn Christ-child. They were the first to\ngive Christmas gifts. Being wise, their gifts were doubtless wise ones.\nAnd here I have told you the story of two children who were not wise.\nEach sold the most valuable thing he owned in order to buy a gift for\nthe other. But let me speak a last word to the wise of these days: Of all\nwho give gifts, these two were the most wise. Of all who give and receive\ngifts, such as they are the most wise. Everywhere they are the wise ones.\nThey are the magi.\n6",
    "est_domaine_public": true,
    "metadata": {}
}