{
    "id": "27e743d7",
    "titre": "The Cats of Ulthar",
    "auteur_nom": "H. P. Lovecraft",
    "categories": [
        "Livres"
    ],
    "date_publication": "1920",
    "etat_classe": "EtatSoumise",
    "contenu_markdown": "The Cats of Ulthar\nby H. P. Lovecraft\nFully annotated\nProduced by David Haden for the 129th birthday of H.P. Lovecraft, 20th August 2019.\nIntroduction\nT\nhis is my online and annotated edition H.P. Lovecraft's well-loved short\ntale of cats and revenge. The story had its written genesis in a poem of\nJanuary 1920 and in a dream. The dream was recalled by Lovecraft in a letter of 21st\nMay 1920. Lovecraft also briefly noted a fragment of this same dream, to serve as\nitem No. 28 in his Commonplace Book of potential story-ideas.\nThe story was written out in full on 15th June 1920, and as written it also seems to\nincorporate his earlier Commonplace Book idea No. 11. The completed story was first\ntypeset and published in the amateur publication The Tryout for November 1920.\nA variant version was re-written from memory in summer 1931, for performance at\nHenry S. Whitehead's regular boys' club in Florida. This version was delivered orally\nto the boys by Lovecraft himself, who was then visiting for an extended stay with\nWhitehead at his home. This 1931 version, possibly handwritten, has not survived.\n•\n•\n•\n•\n•\nThematically related material written by Lovecraft in 1920:\n\"The Street\" (late 1919) (story\nstrange new arrivals; uncouth villains lurk and\nplot in mouldering houses; supernatural forces take revenge on them).\n\"The Terrible Old Man” (January 1920) (story old house, later 'cottage';\nuncouth villains approach the house; revenge and their deaths when inside).\n\"Tryout's Lament for the Vanished Spider\" (January 1920) (poem a beloved\ncreature has vanished and is lamented; the creature is hailed as one of an ancient race\nthat remembers Egypt and Babylon; it is missing but will return to its accustomed\nplace in due course).\n“The Tree” (first half of 1920) (story — mysterious death; revenge)\n“Cats and Dogs” (June 1920)(essay cats venerated in ancient civilisations;\nmaligning and persecution of cats by the ignorant).\nI\nt is said that in Ulthar,¹ which lies beyond the river Skai,² no\nman may kill a cat;³ and this I can verily believe as I gaze\nupon him who sitteth purring before the fire. For the cat is cryptic,\nand close to strange things which men cannot see. He is the soul of\n1 Ulthar — This story is the first to introduce Ulthar, a place later to be developed\nand woven into a number of Lovecraft's stories. He also connected it with his own\nearlier tales. For instance, Dream-Quest has it that the original Pnakotic manuscripts\nwere sent into the Dreamlands from the archives of Olathoë, a city in “distant and\nfrozen Lomar” which was originally in the high Arctic. The manuscripts were carried\ninto the Dreamlands by unknown hands (or paws?) for safekeeping, circa 24,000 B.C,\nwhen the city was over-run by uncouth invaders at the onset of the last great Ice Age.\nIn the Dreamlands a last full copy of these Pnakotic texts was then kept at Ulthar.\nLovecraft's later writing thus connects Ulthar with the setting of his earlier story\n“Polaris” (written 1918), even though Ulthar was not mentioned in that story.\nLovecraft himself is later named as a visitor to Ulthar. As his lightly veiled\npseudonym 'Ward Phillips' he makes an appearance as a character in “Through the\nGates of the Silver Key\" (written 1932-33)... “Phillips, the Providence mystic, was lean,\ngrey, long-nosed, clean shaven, and stoop-shouldered.\" Phillips is deemed to have\nvisited the Dreamlands and... “heard many strange and significant things in Ulthar”,\nand therefore would have encountered the cats there.\n2 Skai — An obvious poetic variant of ‘sky'. As a boy Lovecraft had been a keen\nmeteorologist, and well into his young manhood he was practicing astronomer until\naround late summer 1918 when both his eyesight and his mathematics failed him. This\nfascination fed into his very first expression of weird cosmicism, the long poem “The\nPoe-et's Nightmare” (1916), in which the Lovecraft-a-like poet of the narrative is a\ndescribed as a “student of the skies”. As an astronomer, and in the 1930s sometimes a\n\"fisher” (via radio-set) for distant and exotic stations in other nations, he would\nprobably have been pleased to learn of the huge modern radio telescope named SKAI\n(the Square Kilometer Array Interferometer).\n3 kill a cat\nLovecraft was an staunch Anglophile and there had indeed been such\nlaws in England and Wales, such as in the ninth century when there were heavy fines for\nthose who injured or killed a cat. But in the story Lovecraft strongly evokes and\nencapsulates the real historicity of a much later period across the English Channel.\nNamely, that dark period of religious anti-cat mania to be found in late medieval and\nearly modern northern continental Europe — whose culture Ulthar is evidently partly\npatterned on. Later people became more enlightened, and by Lovecraft's beloved 18th\ncentury the cat was once again back in favour as pet and mouser\nespecially so in\nwhat was by then Great Britain. In that century it was not uncommon for a British poet\nto pen verses on the death of his learned friend's pet cat (Thomas Grey mourning the\ndeath of Walpole's cat, for instance) and Lovecraft continued this poetic tradition for\nhis own friends and their cats. If he actually revived the tradition, rather than simply\ncontinued it, must remain something for the historians of poetic form to discover.\n4\nI gaze - The story was partly inspired by just such a situation...\n“I had a visitor the other night, who gave me an idea for a good story. He\nwas a furry, four-footed young visitor, with a black coat, white gloves & boots,\nantique Aegyptus, and bearer of tales from forgotten cities in Meroë\nand Ophir. He is the kin of the jungle's10 lords, 11 and heir to the\n& white around the tip of his nose & the tip of his tail. He sat in a chair near\nme, purring most inspiringly, when I permitted my fancy to consider his\nancient race & heritage. ...\" - letter of 21st May 1920, in Letters to Rheinhart\nKleiner, pages 190-191.\nThe story was however pre-figured by six months in the form of Lovecraft's poem\n“Tryout's Lament for the Vanished Spider” (January 1920). In this a beloved creature\nhas vanished and is lamented, the creature is hailed as one of an ancient race that\nremembers Egypt and Babylon. It is sure to return to its accustomed place, in time.\nThe creature is of course a spider, not a cat\nbut the elements are the same.\n5\ncannot see Unseen forces are of course a common feature of Lovecraft's work,\nand there are also the unseen rats of \"The Rats in the Walls\" to consider within the\nrange of such phenomena. Vanishing is also a repeated element of the “Ulthar” story.\nCats vanish\nkitten vanishes\nthe slayings and the dark cottage are out of sight of the villagers\nthe\nthe cats vanish the wanderers vanish the cotters vanish and\nthen finally a law... appears. This process of slowly-geared transference of\ndisappearance from the cats to the cotters seems apt, if the story is understood as\nLovecraft working through his emotional pain at the loss of his beloved pet cat in 1904.\n6\nAegyptus Ancient Roman name for the coast and deltas of Egypt, the name being\nsaid to be from the Greek name for the vital temple of Ptah located at the centre of the\nEgyptian city of Memphis. The concluding paragraph of Lovecraft's contemporaneous\nessay “Cats and Dogs” (June 1920) seems to place the origin of the cat even further\nback, being ultimately... \"Babylonian\". Possibly he was thinking of the only mention of\ncats in the Bible, where the author notes with distain that cats are allowed to sit on the\nidols of Babylonia (Baruch 6:22) – from the context, these were domesticated temple\ncats. But to have introduced that fact into the story would be been to confuse the\ncommon reader who casually equated the veneration of the cat with Egypt.\n7\nbearer of tales Likely a wicked pun on ‘tails'. But just possibly also a very obscure\nallusion to Herodotus's most ancient name for cats, the ailuroi, or ‘tail-wavers', that\nbeing his description used on his visit to Egypt.\nIf understood in terms of its import for the story-world, then ‘bearer of tales' implies\nthat cats can tell stories and thus talk. Talk the cats of Ulthar indeed do, albeit in their\nown language, although that occurs only in the later Dream Quest... “Carter now spoke\nwith the leaders [of the cats] in the soft language of cats...” (Dream Quest). In his letters\nLovecraft talks about so ‘conversing' with street-cats he encountered in real-life.\n8 Meroë - There is a tangential cat connection, as Meroë is the destination of the\ntravellers in Henty's travel adventure novel The Cat of Bubastes, A Tale of Ancient Egypt\n(1889). Meroë was a very large island kingdom in what is now the Sudan, “bounded on\nthree sides by the Nile from Atbara to Khartum, the Atbara, and the Blue Nile” (1911\nBritannica), and it was known to the Graeco-Roman world by that name. It was deemed\nby ancient commentators to be a land... “remarkable for its numerous pyramids”, and\nin modern times still “marked by over two hundred pyramids\" to be seen as mounded\nruins in the desert (1911 Britannica). It had few fortified sites and thus appears to have\nbeen held together and defended only by intense religious belief. It appears to have\nended as an independent kingdom in 350 A.D., with natural semi-desertification of the\nregion and shifting Roman trade routes slowly weakening it until finally invading\nsecrets of hoary and sinister Africa. 12 The Sphinx is his cousin, and he\nspeaks her language; but he is more ancient than the Sphinx, and\ntribes could pick it off the map. For fictional purposes, this terminal date might mark\nthe beginning of the 'dark wanderers'\nperhaps priestly groups who might be\nsupposed to have fled from the falling Meroë and have thus begun their wandering,\ntaking their intense lion-god religion and perhaps their sacred cats with them.\nIn archaeological terms the ruins of its central city were first discovered by James\nBruce in 1772. Some hasty Italian attempts at treasure-looting for gold occurred in\n1834, but only succeeded in damaging a few pyramids. With the city location uncertain,\nsome of the likely pyramids were properly excavated for the first time by Budge of the\nBritish Museum in 1902-05. The city was not found, yet a clear link was established with\nthe mainstream of Egyptian culture (e.g. chapters of the Book of the Dead presented as\nwall reliefs, now in the British Museum). Finally the main city mounds were identified\nby Sayce of Oxford (who also excitedly thought he had discovered evidence for African\niron-working later totally disproved) and the city mounds were properly excavated by\nthe University of Liverpool in 1909-10. Thus Meroë was an active site of exciting and\nongoing discoveries in H. P. Lovecraft's youth. A lifelong student and armchair\nexplorer of Ancient Egypt, he would also have read many popular reports on it and seen\nmaps circa 1911-12 when he was about age 21 due to the publication of the final\nexcavation report book Meroë, the City of the Ethiopians, 1911, complete with many\nphotographs. Some further final pyramid excavations were ongoing when Lovecraft\nwrote \"The Cats of Ulthar”, after which the site was abandoned until the 1960s\nwhen the Canadians laboriously uncovered the mundane outlines of the town area.\nMeroë would also have been of interest to Lovecraft ‘the Roman', because it was on\nthe southern edge of Roman influence. Initially hostile to the Empire, skirmishes and\nraids quickly gave way to trade, aided by the strong arm and reach of the Roman army.\nFrom the 1st century B.C. such trade and cultural influence led to the city's heyday. Had\nLovecraft lived to reside down in the hot south of America, and thus translate this\nwarm lush environment into some Solomon Kane-like tales of an ancient Roman map-\nmaker (perhaps a closet vampire, werewolf or similar?) encountering fiends and horrors\nin the ancient cities of the African interior, then Meroë could well have played a part in\nsuch stories offering a suitably liminal terrain in which Lovecraft's great interests of\nEgypt and Rome had met and mingled. For support for this speculation on Africa see\nmy essay “H.P. Lovecraft and Great Zimbabwe”, in my fifth Historical Context book.\n9 Ophir - mentioned in the Bible, but now of unknown location. Reputed to be the\nplace from which the fine gold of Solomon was shipped into his kingdom, though\npossibly not the ultimate source of that gold. I can find no connections with cats.\n10 jungle's lords Lovecraft implies here various forest-cats which live in wild\ntropical places, and he accentuates their aristocratic glamour to chime with his own\nsensibilities. Had he been able to see the final excavation report book Meroë, the City of\nthe Ethiopians, 1911, he would have seen details Meroë's central Lion Temple, and full\npage photographs of the lion-gods on the walls.\n11\nlords\naristocrats.\n12\nIn Lovecraft's “Cats and Dogs” essay he shows that cats to be natural\nhoary - A rough white or pale grey, with age. When paired with sinister it implies\nancient ruins deep in the African interior, ruins which still hold some lurking threat\ndespite their great age and abandonment. Lovecraft, along with members of the\nremembers that which she hath forgotten. 13 In Ulthar, before ever the\nburgesses14 forbade the killing of cats, there dwelt an old cotter15 and\nhis wife who delighted to trap and slay the cats of their neighbours.\nWhy they did this I know not; save that many hate the voice of the cat\nin the night, and take it ill that cats should run stealthily about yards\nand gardens at twilight. 16 But whatever the reason, this old man and\nLovecraft Circle such as Robert E. Howard (Solomon Kane) would later explore this idea\nin fiction. See my long essay on “H.P. Lovecraft and Great Zimbabwe”, on this use and\nwhere Lovecraft might have taken it in fiction had he lived.\n13 Sphinx - In 1905 the sand was completely cleared away from the Sphinx, and the\ngreat monument was seen its entirety for the first time since classical antiquity. As an\neager amateur Egyptophile, the 15 year old Lovecraft would surely have thrilled to this\nand the many other ongoing discoveries from the Near East. Lovecraft specifically\nrefers to the Sphinx several times in his works. In “The Cats of Ulthar” his line\n“remembers that which she hath forgotten\" might be a reference to the way that the\ncurrent face of the Sphinx is a later and cruder addition. Is Lovecraft suggesting that\nthe original face was more cat-like? I believe that a lion-with-mane has been suggested\nby informed theorists of this matter allowing enough stone for the current head-\ndress to be cut out of later stone-carvers. Was this a current theory known to Lovecraft\nin 1920? In his later story “Under The Pyramids”, Lovecraft transfers Houdini's choice\nof story location to the Temple of the Sphinx (a real place, the gate-chapel leading to the\nSecond Pyramid), leading him to speculate again on the nature of the original face of the\nSphinx...\n14\n\"Near the edge of the plateau and due east of the Second Pyramid, with a\nface probably altered to form a colossal portrait of Khephren, its royal\nrestorer, stands the monstrous Sphinx\nmute, sardonic, and wise beyond\nmankind and memory. [...] There are unpleasant tales of the Sphinx before\nKhephren but whatever its elder features were, the monarch replaced them\nwith his own that men might look at the colossus without fear.”\nburgesses - Despite the word's feminine sound, it does not indicate such. It is an\nantiquated British term for the administrator of a local borough or district, and the word\nis now forgotten by all except for a few historians.\n15 cotter - Archaic, a tenant of a rural cottage, often paying rent in the form of\nlabour. Although elsewhere in his work and letters Lovecraft uses it to refer to any rural\ncottage dweller.\n16 at twilight-These lines seem to echo Lovecraft's mother's notion of that at dusk\nsome strange ‘creatures' were likely to rush on her from around corners\n“I remember Mrs. Lovecraft spoke to me about weird and fantastic creatures\nthat rushed out from behind buildings and from corners at dark, and that she\nshivered and looked about apprehensively...\" — Memories of Clara L. Hess,\ngiven in de Camp, Lovecraft: A Biography.\nWhile \"weird and fantastic” might not have been precisely the sort of words to be used by\nan elderly lady from that era, the sentiment was probably more or less correctly\nwoman took pleasure in trapping and slaying every cat which came\nnear to their hovel; and from some of the sounds heard after dark,\nmany villagers fancied that the manner of slaying was exceedingly\npeculiar.17 But the villagers did not discuss such things with the old\nman and his wife; because of the habitual expression on the withered\nfaces of the two, and because their cottage was so small and so darkly\nhidden under spreading oaks at the back of a neglected yard. 18 In\ntruth, much as the owners of cats hated these odd folk, they feared\nthem more; and instead of berating them as brutal assassins, merely\ntook care that no cherished pet or mouser19 should stray toward the\nremote hovel under the dark trees. When through some unavoidable\noversight a cat was missed, and sounds heard after dark, the loser\nwould lament impotently; or console himself by thanking Fate that it\nrecorded. Lovecraft was, at spring 1920, just beyond the first anniversary of the loss of\nhis mother to the insane asylum, although he visited her there regularly and may have\ncontinued to hear such 'dark creature' fears from her as they walked and talked\ntogether in the shadowy wooded asylum grounds. One might later see such fears\nreflected in Malone's fear of rigidly angular brick buildings in the story “Red Hook”, the\ncorners and angles of “Witch House”, and the bizarrely-angled risen city of “Cthulhu”.\n17 strange pleasure .. exceedingly peculiar — this is one such example in Lovecraft's work;\nothers include the murderous necrophilia that forms the central concern of “The Loved\nDead”, written a few years later in 1923\nreputedly the story that caused Weird Tales\nmagazine to be banned in Indiana'.\n18 neglected yard-\nPoe had a similar setting for the hanging of the cat in his macabre\nrevenge tale of a cat-killer, “The Black Cat”... “One morning, in cool blood, I slipped a\nnoose about its neck and hung it [the cat] to the limb of a tree”, this dreadful deed being\ndone in the shabby yard of “the old building which our poverty compelled us to\ninhabit”. Thus, although “The Cats of Ulthar” is often said to be Dunsanian, is can\nequally be called Poe-esque in term of its setting and cat-death.\nAs for the ominous dark trees which cover this yard, note that Lovecraft explored the\nrelated idea of a weird sentient tree actually talking the killing revenge, in his story “The\nTree” which was also written in \"the first half of 1920” (Lovecraft Encyclopedia).\n19 mouser — a once-common term for a domestic or farm cat kept because it caught\nand despatched many mice each night. Less common today, but still understood.\nwas not one of his children who had thus vanished. 20 For the people\nof Ulthar were simple, and knew not whence it is²¹ all cats first came.22\nOne day a caravan23 of strange wanderers from the South24 entered\nthe narrow cobbled streets of Ulthar. Dark wanderers25 they were, and\nunlike the other roving folk26 who passed through the village twice\n20 vanished — In a later Lovecraft story, “The Horror at Red Hook”, it is the young\nchildren of Norwegian sailors who vanish and are horribly sacrificed by the newly-\narrived cult in the slum of Red Hook. Young children are also snatched by cults, for\nsacrifice, in a number of his other stories.\n21\nis - Lovecraft uses “is”, not was. Thus he implies that the place still exists.\n22 knew not\nThis is rather gnomic. Possible Lovecraft means to imply that the cats\nof the Dreamlands come from some outer place or dimension, and thus cannot be truly\nkilled in such a way. With the implication that therefore there is no need to lament their\napparent death, while also offering a reason why they have such immensely long\nmemories. If so then this may also obliquely reference to the traditional folk idea that\ncats have 'nine lives', extending this to a form of implied semi-immortality perhaps in a\nstate akin to vampires. Rather more simply, Lovecraft may have meant to imply only\nthat the people of Ulthar do not know the ancient language and invocation needed to\nbestir all the local cats to wrathful revenge, as young Menes does later in the story.\n23 caravan This indicates not a single wheeled structure, but rather a long strung-\nout line of wooden wagons, carts and pack-animals, and a nomadic travelling group.\n24\nSouth The wanderers must therefore have been coming from the port of\nDylath-leen, and would have recently travelled over the sea to reach that port.\n25\nDark wanderers Historically, in the 5th Century Herodotus visited Egypt and used\n'the burnt faced ones' to refer to the northern Ethiopians from Meroë in the far south\nof Egypt. To forestall future confabulation on this point, I should add that the final\nexcavation report on the city of Meroe notes... “The Meroites were not negroes. The\nruling class is represented with high foreheads, straight noses, and thin lips, while the\ncomplexion was fair. The skin is painted red like that of the Egyptians or the people of\nPunt.\" (from Meroë, the City of the Ethiopians, 1911, page 55).\nIn fiction, S.T. Joshi notes the resemblance to the Wanderers (capital W) in Dunsany's\nfamous dreamland-story “Idle Days on the Yann”. Lovecraft first encountered\nDunsany in the Autumn/Fall of 1919, and the resulting 'Dunsany phase' would last two\nyears. Thus “Cats” was written while Lovecraft was in the full grip of his first great\nimpetus toward emulating Dunsany.\n26\nroving folk — evidently a nomadic people, akin in appearance, practices and wagon-\ndecoration to the gypsies of Earth. When gypsies first appeared in England in the 16th\ncentury they were surmised to have come from Egypt, and thus named 'gypsies. By\nLovecraft's time their ancestral origins was instead known, by the linguistics, to be in\nnorthern India\nand this was much later confirmed by genetic science. Yet Lovecraft's\nfictional wanderers are not earthly gypsies, and thus he is free to imply that this\nparticular band arises from Egyptian culture. Indeed, the opening lines of his story hint\nthat they might be travellers who found their way into the Dreamlands from lost parts\nof upper Egypt far to the south, such as Meroë, when that civilised and fertile place of\nevery year. In the market-place they told fortunes for silver, and\nbought gay beads from the merchants. What was the land of these\nwanderers none could tell; but it was seen that they were given to\nstrange prayers, and that they had painted on the sides of their wagons\nstrange figures with human bodies and the heads of cats, hawks, rams,\nand lions.27 And the leader of the caravan wore a head-dress with two\nhorns and a curious disc betwixt the horns.28\nThere was in this singular caravan a little boy with no father or\nmother, 29 but only a tiny black kitten to cherish. The plague had not\n\"numerous pyramids” was destroyed by a combination of shifting Roman trade routes,\nnatural desertification and invading tribes. If this band is meant to be an implied branch\nof Dunsany's Wanderers, then they would arrive every seven years in Ulthar, coming\nfrom some unknown and fantastic desert land beyond the “high” mountain range of\n“Mloon”. Lovecraft's later linkage of the cats of Ulthar with the Moon, in his epic\nDream Quest, does suggest that the alert intertextual reader is meant to feel that perhaps\nthe Moon itself is the strange unvisited “strange far desert” that lies high beyond the\nmountains of Mloon. Here also we see Lovecraft starting to perceive how a loosely\ncoherent mythos could be very lightly developed among different authors, without any\ncentral co-ordination or ‘rule-book'. And how he could himself then add intertextual\ninterweavings to his later own works which would subtly enhance his earlier works, and\neven enhance those of other writers.\n27 strange figures .. cats, hawks, rams, and lions\nThe invocation of the visual appearance\nof part of the Ancient Egyptian pantheon is obvious. Also, in Ancient Egypt it was\npunishable by death to kill either the cat or the hawk\nthus the pairing and the first-\nplacement here may be an indication that Lovecraft knew of such matters.\n28 curious disc .. horns - Ancient Egyptian religion is again evoked. While the head-\ndress suits various deities we probably have here a priest of the Moon god Thoth\n(Thut), wise scribal writer for the gods and father of astronomy. Both aspects would\nhave fitted with Lovecraft's interests, and also with the “Mloon” of Dunsany's\nWanderers. There is a further reason for choosing Thoth. Lovecraft may also have\nbelieved, with the Greeks, that cats were understood in Ancient Egypt to be “children\nof the moon\" later events in Dream Quest would seem to partly confirm this.\n29 no father or mother — At this time Lovecraft's father had died in the madhouse and\nhis mad mother was in the asylum and had only about a year to live. There was,\nhowever, at that time no reason to suppose she would physically die soon, and it\nappears that Lovecraft was not aware of the exact nature of his father's death. Yet\nLovecraft had, in effect, lost both his mother and father in terms of their nurturing and\nguiding roles. He had also relatively recently lost his uncle, grandfather and even his\ncherished younger cousin.\nbeen kind to him, 30 yet had left him this small furry thing to mitigate\nhis sorrow; and when one is very young, one can find great relief in the\nlively antics of a black kitten. 31 So the boy whom the dark people\ncalled Menes32 smiled more often than he wept as he sate playing with\nhis graceful kitten³³ on the steps of an oddly painted wagon.\n30 plague - Lovecraft was writing just 18 months after the last of a series of killer\ninfluenza epidemics, which had killed at least 50 million people around the world. In\nthe worst phase during October 1918, in the nearby city of Boston deaths ran at 200 a\nday - mostly young adults in the prime of health. Thus the word “plague” would have\nhad a strong resonance with many of his readers in 1920. At a personal level, he was\nalso writing on the ten year anniversary of his successful convalescence after a near-\nkiller bout of measles, which he appears to have suffered in early 1910.\n31 black kitten Lovecraft was, of course, a lifelong cat-lover yet he only ever\nowned one cat and preferred instead to 'borrow' them (rather like his library-books).\nHis only ‘owned cat' had been lost traumatically in the fall/autumn of 1904, when\nLovecraft had just turned 14 years old, he had to leave his beloved childhood and family\nhome. During the house move his pet black cat ran away and was never seen again.\nThis cat features again and is named in “The Rats in the Walls” (written August-\nSeptember 1923), where it is stated to be “seven years old” and Lovecraft notes rather\npoignantly that it had “come with me from my home”.\nCorrelating these dates, a real pet cat that was seven years old in 1904 was thus likely\nto have been a new kitten and thus given its name\nwhen Lovecraft was aged\nabout 7. That seems about the right time of life for a bright child to be given such a pet\nto care for, and it might be plausibly suggested that a real black kitten was likely given to\ndistract the boy Lovecraft from thoughts of the death of his father (July 1898). We\nknow from a letter that the cat had indeed been had from a kitten, as Lovecraft states in\na letter... “I watched him grow from a tiny black handful” and the same cat had then\nbeen had for many years.\nThe naming of this cat\ntoday often used by Lovecraft's anti-fans as a political stick\nwith which to idly beat and deride him as being “as reptilian as some of his cosmic\nhorrors\" etc is thus rather open for debate. In terms of asking whether a seven year-\nold, or some adult relative or servant in the household, would have given this cat its\nthen-common and unremarkable name.\n32 Menes Menes, founder of Memphis and deemed to have been the first mortal\nwho ever reigned in Egypt, probably c. 2750 B.C (at a best-guess by scholars). Memphis\nbeing the Greek name for an Ancient Egyptian city sited strategically near the wide and\nfertile reaches of the Nile river delta (which, incidentally, were then believed to have a\nsort of Dreamlands equivalent superimposed upon them). This most ancient city was\nthe centre of the god-cult of Ptah, and linguists state that the Greeks derived the name\n'Aegyptos' from the name of Ptah's temple in the centre of the city this name later\nbecame Aegyptus under the Romans and thus our own name ‘Egypt'. Lovecraft, being\nan intense Egyptophile from an early age, would have been aware of such matters.\nInterestingly, in relation to Lovecraft's own mythology, Ptah is the deification of the\narchaic 'primordial mound' god of ‘risen land', i.e. the god of submerged land that has\nOn the third morning of the wanderers' stay in Ulthar, Menes could\nnot find his kitten; and as he sobbed aloud in the market-place certain\nvillagers told him of the old man and his wife, and of sounds heard in\nthe night. And when he heard these things his sobbing gave place to\nmeditation, and finally to prayer. He stretched out his arms toward\nthe sun and prayed in a tongue no villager could understand;34 though\nindeed the villagers did not try very hard to understand, since their\nattention was mostly taken up by the sky and the odd shapes the\nclouds were assuming.35 It was very peculiar, but as the little boy\nuttered his petition there seemed to form overhead the shadowy,\nnebulous figures of exotic things; of hybrid creatures crowned with\nhorn-flanked discs.36 Nature is full of such illusions to impress the\nimaginative.37\nspontaneously risen from the sea or the Nile delta\nthis might remind one of the\nsetting in Lovecraft's “Dagon” and also of R'lyeh in “The Call of Cthulhu”.\n33\nplaying with Lovecraft wrote a variety of observations and poems on the beauty\nand grace of kittens and cats, and is also known to have carried some catnip with him\n(some say in the form of a 'catnip mouse') on his walks in order to attract the\nattentions of suitable felines. His various writings on the felidae and felis (as he\nsometimes also called them) are now to be found in The H.P. Lovecraft Cat Book (2019).\n34 prayed in a tongue The boy Lovecraft had fashioned makeshift turfy and bowered\nshrines to nature deities in the fields near his home and later by the banks of the\nSeekonk near his home. “I have in literal truth built altars to Pan, Apollo, Diana, and\nAthena” (from “A Confession of Unfaith”). His early facility for languages was such\nthat he probably invoked such deities in Latin or Greek.\n35 odd shapes .. clouds Also written in 1920, Lovecraft's story “The Street” has a sky-\nvision, and also in a tale of local revenge involving a tree-shaded sentient street...\n\"The poet says that all through the hours before dawn he beheld sordid\nruins but indistinctly in the glare of the arc-lights; that there loomed above the\nwreckage another picture wherein he could descry moonlight and fair houses\nand elms and oaks and maples of dignity.\"\nThere may in both instances be some slight influence here from the press reports of the\nfamous visions of the ‘Angels of Mons', an event during the First World War?\n36\nhorn-flanked discs Again, the reference is likely to be to the Moon god Thoth.\n37 Nature is full of such illusions As a boy meteorologist, complete with a daily-tended\nweather station, Lovecraft would have spent much time observing clouds. Given his\nThat night the wanderers left Ulthar, and were never seen again.\nAnd the householders were troubled when they noticed that in all the\nvillage there was not a cat to be found. From each hearth the familiar\ncat had vanished; cats large and small, black, grey, striped, yellow, and\nwhite. 38 Old Kranon, 39 the burgomaster, 40 swore that the dark folk\ntaste for vivid imaginings we might assume he often 'saw' faces and animals in the\nclouds. We certainly know he glimpsed earthy faces in the glades and pools along the\nSeekonk shoreline... \"which my infant imagination peopled with fauns & satyrs &\ndryads\" (letter of 8th July 1929, referring to the wooded bluff above York Pond).\n“When about seven or eight I was a genuine pagan, so intoxicated with the beauty of\nGreece that I acquired a half-sincere belief in the old gods and Nature-spirits. I have in\nliteral truth built altars to Pan, Apollo, Diana, and Athena, and have watched for dryads\nand satyrs in the woods and fields at dusk. Once I firmly thought I beheld some of\nthese sylvan creatures dancing under autumnal oaks...” (“A Confession of Unfaith”).\n38 each hearth The wide variety of cat breeds might here suggest that Ulthar is\nhome to many stray cats, lost and abandoned in the real world, who then find their way\ninto the Dreamlands and thus to comfortable hearths in a town seemingly without any\ndogs. That the cats of Ulthar are able to make “the great leap through space back to the\nhousetops of our earth and its dreamland” from the Moon's dark side, in Dream Quest,\nsuggests they may have many ways of travel that are only guessed at by humans,\nthose...\n\"cryptical realms which are known only to cats and which villagers say are on\nthe moon's dark side, whither the cats leap from tall housetops” (from Dream\nQuest).\nIn 1929 Lovecraft used the existence of 'cat-ladders' at Mrs Beebe's rural house near\nWilbraham to suggests a similar magical inter-dimensional transportation to his fellow\nwriter H. Warner Munn. Munn was unaware that secret cat passages had been built into\nin the walls of Beebe's old home. To Munn's eyes, it thus appeared that some of Mrs\nBeebe's cats would magically spirit themselves out of locked and sealed rooms. This\npartly inspired Munn's short story “The Cat Organ” (Weird Tales, November 1930,\nheaded there Tales of the Werewolf Clan, 1: The Cat Organ'). Mrs Beebe's cat-ladders\nalso appear in the Lovecraft poem \"[To a Cat]” (circa late 1920s), which can be found in\nThe Ancient Track.\n39 Kranon the Ancient Greek kranion meant ‘the tough and encased upper part of\nthe skull', and this may be an obvious source for a name for a hard-headed leader called\nKranon. Yet in Ancient Greek, Krannon or Kranon (spellings are indifferent) was also a\ncity name meaning ‘a rocky cairn' with the implication of a high ‘head-horn' of rock at\nthe head of a crooked hill, and thus the name also implies a certain loftiness and\ndifficulty in approach. This city's storm-foretelling pair of black ravens, often\nmentioned in books of strange animal lore, may have first brought the city's name to\nLovecraft's attention. One might then plausibly suppose that such high and inaccessible\nrocky places were long the lairs of wild-cats in semi-arid areas, and thus one would have\na useful connection between the word and the origins of tamed cats.\nhad taken the cats away in revenge for the killing of Menes' kitten; 41\nand cursed the caravan and the little boy. But Nith, the lean notary, 42\ndeclared that the old cotter and his wife were more likely persons to\nsuspect; for their hatred of cats was notorious and increasingly bold.\nStill, no one durst43 complain to the sinister couple; even when little\nAtal, the innkeeper's son, vowed that he had at twilight seen all the\ncats of Ulthar in that accursed yard under the trees, pacing very slowly\nand solemnly in a circle around the cottage, two abreast, as if in\nperformance of some unheard-of rite of beasts.44 The villagers did not\nknow how much to believe from so small a boy; and though they\nfeared that the evil pair had charmed the cats45 to their death, they\nA variant of krannon was perhaps also used by the Greeks to describe the 'hard head-\nlike' quality of certain very tough pips, such as acorns and cherry pips, although this\nappears to be the plausible surmise of a few modern linguistic scholars and was unlikely\nto have been known to Lovecraft. Similarly Lovecraft probably didn't see any\nconnection from kranion to the Latin form calvaria (‘skull’) to the place called Calvary\n('hill of skulls'), the famous high barren rock outcrop and place of Christ's crucifixion.\n40 Burgomaster — name for a head of a town or district in continental northern\nEurope. Equivalent of a town mayor. Of continental European origin and thus\nperhaps another small nod toward the Grimm fairy-tale tradition.\n41 taken the cats away There is a faint echo here of the famous northern European\nfolk-story which generally goes by the name of the “Pied Piper of Hamelin”, in which\nall the children of a river-port are one day charmed my music into a walking line and led\naway into the mountain-side. Extermination of creatures and bitter revenge are similarly\ninvolved in the “Pied Piper”, and the cats of Ulthar likewise go off to pace two-by-two\nand vanish into a dark place. The general river-port setting is also somewhat similar.\nnotary An official entrusted to conduct non-contentious and routine legal\nmatters, especially the witnessing of signatures, marks and seals placed on important\n42\ndocuments.\n43 dusrt\n44\narchaic English, here meaning 'dared to'.\nperformance - Early in Lovecraft's Commonplace Book, item #11 he noted the story-\nidea... \"Odd nocturnal ritual. Beasts dance and march to musick.\"\n45 charmed the cats Lovecraft was an expert ‘cat charmer', and he kept catnip on his\nperson for attracting suitable cats he encountered on his walks. Thus he presumably\nsometimes feared that others might use similar ‘cat charming' methods for more\nnefarious purposes, especially in slum areas. In 1917 one can find calls in American\nnewspapers for the introduction of the role of “official cat-catcher”, to match that of\nthe traditional town dog-catcher.\npreferred not to chide the old cotter till they met him outside his dark\nand repellent yard.\nSo Ulthar went to sleep in vain anger; and when the people awaked\nat dawn-behold! Every cat was back at his accustomed hearth!\nLarge and small, black, grey, striped, yellow, and white, none was\nmissing. Very sleek and fat did the cats appear, and sonorous with\npurring content. The citizens talked with one another of the affair,\nand marvelled not a little. Old Kranon again insisted that it was the\ndark folk who had taken them, since cats did not return alive from the\ncottage of the ancient man and his wife. But all agreed on one thing:\nthat the refusal of all the cats to eat their portions of meat or drink\ntheir saucers of milk was exceedingly curious. And for two whole days\nthe sleek, lazy cats of Ulthar would touch no food, but only doze by\nthe fire or in the sun.\n47\nIt was fully a week before the villagers noticed that no lights were\nappearing at dusk in the windows of the cottage under the trees.\n46 sonorous - A pleasantly deep loud sound, here the loud purring sound of the type\ntypically made by contented cats.\n47 two whole days — In late summer 1918 Lovecraft's mother, in his words,“breaks\ndown\". Lovecraft states that he had a likewise breakdown due to this and thus did\n\"nothing” for “two months” Lord of a Visible World, page 68. This memory is\nsupported by the dating of his poems, in the production of which there is a long gap at\nthat time. There is thus a small ‘fit' here between the story and Lovecraft's own\nbiography.\nThen the lean Nith48 remarked that no one had seen the old man or\nhis wife since the night the cats were away. In another week the\nburgomaster decided to overcome his fears and call at the strangely\nsilent dwelling as a matter of duty, though in so doing he was careful\nto take with him Shang49 the blacksmith and Thul50 the cutter of stone\nas witnesses. And when they had broken down the frail door they\nfound only this: two cleanly picked human skeletons on the earthen\nfloor, 51 and a number of singular beetles crawling in the shadowy\ncorners.\n52\n48\nNith - a city alluded to once in Dunsany, who has…… “the green eyes of the\nmountain men who had looked at him strangely in the city of Nith when he had entered\nit by the desert door.” (“The Coronation of Mr. Thomas Shap”, 1912). Possibly this\nwas Dunsany's nod to the Nith from... \"the stream called Nith Neamhnach, which turned\nthe first water-mill erected in Ireland by King Cormac for his wife and bondsmaid\"\n(Royal Society of Antiquaries of Ireland, 1894). Nith thus appears to once have\nindicated a fast tight river, which might explain why a visitor rarely entered the city of\nNith by the 'desert door', there presumably also being a preferred ‘river door'.\nNith is also the name of a lovely and fast Scottish river known by poets. The famous\nScots poet Robert Burns has in his “A Vision”... “Hasting to join the sweeping Nith”.\nPoe, in an essay on the poems of Fitz-Greene Halleck, noted Halleck's verses on\n\"Burns\" which posit that... \"by the Doon's low trees, And pastoral Nith and wooded\nAyr” are the best sites at which to remember the poet Burns. From the early Victorian\nperiod one can also find a local tale of how a lost “ghost” cat once swam the Scottish\nNith to return living to its owner (John McDiarmid, Sketches from nature, 1830)\nbut it\nseems unlikely that Lovecraft knew of this local fireside tale.\n49 Shang - Chinese name, associated with the ancient ruling dynasty famous for their\npower and their strong development of metalworking. Thus a name suited to a\nblacksmith.\n50 Thul - An old name in India for an empty place, roughly indicating a little desert\nof sand-ridges', and thus suited to be the name of a stone carver. Also occurs in\nDunsany as a place name...“sometimes my dreams took me as far as Pungar Vees, the\nred walled city where the fountains are, which trades with the Isles and Thul.” (Idle Days\nOn The Yann).\n51\ncleanly picked - A similar fate awaits... \"the hungry zoogs who looked evilly at a\nsmall black kitten” in Lovecraft's later Dream Quest tale. Thus the modus operandi of the\nCats of Ulthar is somewhat akin to the famous piranha.\n52\nsingular beetles - although the species is unspecified here, the scarab beetle had a\nkey role for the Ancient Egypt pantheon. Scarab beetles are closely associated with the\nlion-god in the carvings at Meroe see Meroë, the City of the Ethiopians, 1911, page 64.\nThere was subsequently much talk among the burgesses of Ulthar.\nZath, 53 the coroner, 54 disputed at length with Nith, the lean notary;\nand Kranon and Shang and Thul were overwhelmed with questions.\nEven little Atal, the innkeeper's son, 55 was closely questioned and\ngiven a sweetmeat as reward. They talked of the old cotter and his\nwife, of the caravan of dark wanderers, of small Menes and his black\nkitten, of the prayer of Menes and of the sky during that prayer, of the\ndoings of the cats on the night the caravan left, and of what was later\nfound in the cottage under the dark trees in the repellent yard.\nAnd in the end the burgesses passed that remarkable law which is\ntold of by traders in Hatheg57 and discussed by travellers in Nir;58\nnamely, that in Ulthar no man may kill a cat.59\n53 Zath- Arabic form of the name for an ancient nomadic Indian tribe known in\nSindh in India, a tribe theorised in Victorian times as one of the three roots of the\nmodern nomadic gypsy people. It may indicate that Lovecraft did a little research in\nencyclopaedias and at the public library, to find such choice details for his story.\n54\ncoroner A person formally entrusted with the authority to enquire into the cause\nof a death and to establish the identity of the deceased.\n55 Atal - this appears to be a Sikh name most common in the Punjab of India.\nThere may be some connection here with the famous ‘Baba Atal'. This Atal brought his\nbest friend back to life after a sudden death and for thus breaking the laws of nature\nhe went into a trance and died at the age of nine. Among Sikhs this 'boy of light' is\ngreatly revered and has the title 'Baba', a title given usually to a ‘grand old man'.\nHad Lovecraft encountered this while researching gypsy origins for the story, he might\nhave seen in this account a poignant reflection of his friendship with Phillips Gamwell,\nLovecraft's beloved young cousin, who had died young on 31st December 1916. Also\nperhaps a reflection of with his own chosen stance in life as a boyish ‘old gent'.\nAs a character from “The Cats of Ulthar”, Atal later also appears in the Lovecraft\nstory \"The Other Gods” where he is apprentice to Barzai the Wise. Later he appears in\nThe Dream-Quest of Unknown Kadath as a three-hundred year-old bearded sage at the\nTemple of the Elder Ones in Ulthar.\n56 Sweetmeat Not actually meat, but rather a sweet crystalline product such as dried\nfruits preserved in a sweet glaze, or lozenges made with ingredients such as honey and\nclarified butter.\n57\nHathega settlement of traders somewhat near to Ulthar, and presumably located\non the edge of the desert, most likely at some point higher than Uthar (which is down\non the river below). Hatheg is said to be within occasional sight of the distant desert\npeak of Hatheg-Kla... “Hatheg-Kla is far in the stony desert beyond Hatheg\" (from\n“The Other Gods”).\nWhat of the name Hatheg? The Hatheg-el-Habesch is mentioned in Ludilfi's Historia\nAethiopica (1681), in discussing the names various local peoples have for the highest\nrulers of what we know as the large country of Habesh or Al-Habash (Abyssinia, later\nnorthern Ethiopia). This nebulously bordered and largely mountainous country is\nindeed very high, much being some “10,000 feet above the level of the sea” and such a\nterrain meant that it once had many groups and local rulers within it. In that context\nHatheg or Hatzeghe (Arabic) translated to ‘king of kings', or the Emperor over all' the\nmany lesser kings in Habesh (Jeronimo Lobo, A Voyage to Abyssinia, 1735, pages 253-\n254). Lovecraft's choice of the name Hatheg for his lofty mountain is thus quite apt\nit surveys all and dominates all the wide land around it.\nWhat then of –kla? In this same high region a takla was the name for a ‘holy plant of\nfaith', and generally poetically indicated a 'springing up of renewed Christian faith\n(ascending holiness)' when found as the personal name Takla (e.g.: among saints, “the\nexhumed body of Takla Haymanot was found undecayed 57 years after its burial\",\nBudge, 1906). Thus, Lovecraft is again broadly correct in appending –kla to Hatheg-kla,\nthough both religious scholars and linguists will no doubt splutter at his joining the two\ntogether in such a cavalier way.\nThus, in Lovecraft's mind Hatheg-Kla could have indicated to the people of the\nDreamlands something akin to the 'emperor-mountain of the ascending spirits'.\n58 Nir - a settlement quite near Ulthar, but on the other side of the river Skai.\n59\ncat\n· The cats of Ulthar return in force in Lovecraft's long dream-adventure The\nDream-Quest of Unknown Kadath (written autumn/fall 1926-January 1927).\nThe Lion-god in his temple at the city of Meroë, as seen in the frontispiece of the\nfinal excavation report book Meroë, the City of the Ethiopians, 1911.\n“... of human form, lion-headed, and wearing a remarkable head-dress, consisting of three\nbundles, flanked by feathers and crowned uraei, and supported on a pair of horizontal ram's\nhorns. This head-dress is often seen in the Egyptian temples on the heads of the Ptolemies\nand Roman emperors, and is also associated with Thoth [the moon-god], who was\nworshipped at Dakka, and Mandulis of Kalabsha. [In contrast, elsewhere] The Egyptian lion-\ngod Mihôs, Miysis, ‘fierce-eyed lion,' ordinarily wears a simpler form of the same...” and has a\ndifferent name.\nCreer 100\nBroo\n100\nRiver\n00\n200\nAvers\n200\n300\nRound\nPond\nKenoza Lake\nPlug Fond\nHaverhil\nGEO\n100\n200\nden FINI\n100\nCharles W. \"Tryout” Smith (1852-1948) by Daniel Pond. With thanks to Kenneth W. Faig Jr.\nHere Smith is seen in his shed among his friendly spiders and old-time curios, in the\nprocess of picking out the metal type (individual letters) which would enable him to\nset up a page of another issue of his amateur magazine The Tryout for hand-printing.\nSmith was a long-time ‘amateur journalist' and elderly friend of the young H.P.\nLovecraft, with whom he appears to have come into contact by letters in 1917.\nSmith lived about sixty miles north of Lovecraft, and they first met in 1921. His\nhome was Haverhill, about ten miles inland along the Merrimack River from the\nNew England coastal town of Newburyport (Lovecraft's model for Innsmouth). A\nlively and boyish old man, Smith kept alive the old-time amateur ideal of the\nindependent 'boy printer' by typesetting, printing and mailing his amateur journal\nThe Tryout from 1914 until 1946. It was in the November 1920 issue that “The Cats\nof Ulthar\" first appeared, and he also published other stories and poems by Lovecraft.\nThe character ‘Preserved’ Smith in Lovecraft's \"The Shunned House” (1924), an\nelderly servant who has the sense to quit the evil house, is probably a nod to Smith.\nCover illustration: David Haden.\nBack cover: my Photoshop adaptation and HPL-morphing of an old public domain book illustration.",
    "est_domaine_public": true,
    "metadata": {
        "ai_analysis": true,
        "ai_reason": "H.P. Lovecraft died in 1937, and the story was first published in 1920, placing it in the public domain in many jurisdictions (e.g., US copyright expired due to publication date, and author's death + 70 years has passed in others)."
    }
}